cases/bigleafFoam/cubeTree2D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1; // hb=0.12

vertices
(
    (0 0 0)
    (12 0 0)
    (18 0 0)
    (48 0 0)
    (0 0 4)
    (12 0 4)
    (18 0 4)
    (48 0 4)
    (0 0 10)
    (12 0 10)
    (18 0 10)
    (48 0 10)
    (0 0 30)
    (12 0 30)
    (18 0 30)
    (48 0 30)
    (0 1 0)
    (12 1 0)
    (18 1 0)
    (48 1 0)
    (0 1 4)
    (12 1 4)
    (18 1 4)
    (48 1 4)
    (0 1 10)
    (12 1 10)
    (18 1 10)
    (48 1 10)
    (0 1 30)
    (12 1 30)
    (18 1 30)
    (48 1 30)
);

blocks
(
    hex (0 1 17 16 4 5 21 20)
    fluid1 (37 1 20) simpleGrading (0.1770370334 1 0.3903326793)

    hex (1 2 18 17 5 6 22 21)
    fluid2 (50 1 20) simpleGrading (1 1 0.3903326793)

    hex (2 3 19 18 6 7 23 22)
    fluid3 (54 1 20) simpleGrading (12.634717429797567 1 0.3903326793)

    hex (4 5 21 20 8 9 25 24)
    fluid4 (37 1 50) simpleGrading (0.1770370334 1 1)

    hex (5 6 22 21 9 10 26 25)
    vegetation (50 1 50) simpleGrading (1 1 1)

    hex (6 7 23 22 10 11 27 26)
    fluid6 (54 1 50) simpleGrading (12.634717429797567 1 1)

    hex (8 9 25 24 12 13 29 28)
    fluid7 (37 1 45) simpleGrading (0.1770370334 1 9.116414656040122)

    hex (9 10 26 25 13 14 30 29)
    fluid8 (50 1 45) simpleGrading (1 1 9.116414656040122)

    hex (10 11 27 26 14 15 31 30)
    fluid9 (54 1 45) simpleGrading (12.634717429797567 1 9.116414656040122)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 16 20 4)
            (4 20 24 8)
            (8 24 28 12)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 19 23 7)
            (7 23 27 11)
            (11 27 31 15)

        );
    }
    sky
    {
        type wall;
        faces
        (
            (12 13 29 28)
            (13 14 30 29)
            (14 15 31 30)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 17 16)
            (1 2 18 17)
            (2 3 19 18)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (4 5 9 8)
            (5 6 10 9)
            (6 7 11 10)
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
            (16 17 21 20)
            (17 18 22 21)
            (18 19 23 22)
            (20 21 25 24)
            (21 22 26 25)
            (22 23 27 26)
            (24 25 29 28)
            (25 26 30 29)
            (26 27 31 30)
        );
    }
);


mergePatchPairs
(
);

// ************************************************************************* //
