cases/bigleafFoam/cubeTree2D/system/decomposeParDict

// * * * * * * * * * //
FoamFile
{
	version 0.5;
	format ascii;
	root "ROOT";
	case "CASE";
	class dictionary;
	object nix;
}
method simple;
numberOfSubdomains 4;
simpleCoeffs
{
  delta 0.001;
  n (2 2 1);
}
