cases/bigleafFoam/cubeTree2D/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cell; //cellPointFace;

setFormat raw;

surfaceFormat foamFile;

fields
(
    E
    epsilon
    gradU
    k
    LAD
    LAI
    nut
    p
    q
    Ql
    Qs
    qsat
    ra
    Rg
    rhosat
    Rn
    Sh
    Sq
    Su
    T
    Tl
    U
    vorticity
);


surfaces
(

    constantPlane
    {
        type            plane;    // always triangulated
        basePoint       (0 0.5 0);
        normalVector    (0 1 0);
        interpolate     true;
        triangulate     true;
    }

);

sets
(
    xMidVeg
    {
        type            face;
        axis            xyz;
        start           (15 0.5 0);
        end             (15 0.5 30);
    }

);
